ada_1 = '''Начнем с документов 📝 – для официального оформления вам нужно подписать все кадровые документы у Дианы d.nichikova@2035.university. 
Для оформления тебе потребуются cканы или качественные фотографии следующих документов:
· Паспорт (все заполненные страницы)
· СНИЛС
· Трудовая книжка (все заполненные страницы + следующая пустая)
· Диплом и вкладыши к нему
· Военный билет/приписное удостоверение (все страницы, даже незаполненные) (для военнообязанных граждан)
· ИНН
· Реквизиты текущего банковского счета

Остались вопросы? 
Посмотри наш FAQ: https://telegra.ph/Voprosy-po-dokumentam-07-07 или обратись к коллегам: 
Софья - s.morozova@2035.university, 
Диана - d.nichikova@2035.university, 
Общая рассылка отдела кадров - HR@nti.work
'''

ada_2 = '''💻 Настройка оборудования и всех доступов. 
В экосистеме НТИ много систем с несколькими уровнями доступа, процесс может занять несколько дней. Это нормально. 
Если вы уже оформились в компанию, пора разобраться с настройкой оборудования и понять, какие программы будут полезны вам в работе. 
Запишите самый важный контакт на сегодня - Денис Пастухов du.pastuhov@nti.work, именно он поможет вам с оборудованием.

Личный пропуск для входа в офис “Сколково” можно получить у Григория Осипова g.osipov@2035.university. 

Для входа в офис - “Точка кипения” нужно зарегистрироваться на https://leader-id.ru/ и показать qr-код на входе.
Сеть Точек кипения - бесплатные коворкинги для общения, работы и проведения мероприятий с системой поддерживающих цифровых сервисов. 
Подробнее о Точках ты можешь почитать в <a href="https://www.facebook.com/groups/boilingpoints/">Facebook</a>.
'''

ada_3 = '''Помимо документов пришлите, пожалуйста: 
📸 Свою фотографию Алене - @AlenaDudinaa или a.dudina@2035.university
📲 Актуальный номер мобильного - чтобы всегда оставаться на связи.  

Фотография должна быть в деловом стиле – необходима для знакомства с вами в условиях удаленки. 
Лучше всего подойдет фото средним или крупным планом.
'''

ada_4 = '''Кстати, вы уже успели познакомиться с нашим <a href="https://drive.google.com/file/d/1iUTtOaP0GcZq5tExRZFpw1wTOqdOqv0t/view?usp=sharing">Welcome Book</a>? 📗 
Это специальный гайд для новичков, который помогает узнать об экосистеме НТИ больше и погрузиться в нашу атмосферу. 
Постарайся прочесть его как можно скорее, чтобы адаптация прошла еще быстрее и понятнее 🚀
'''

ada_5 = '''Еще я могу рассказать, как пройдет твой первый рабочий день 💼 
и поделиться ссылками на наши соц. сети 📱

Готовимся к крутому пути в экосистеме НТИ 🛣😎 
А именно — официально оформиться в компании, познакомиться со своим руководителем, получить первые вводные по процессам и основным задачам, подключиться к необходимым системам и настроить доступы. 
Мы позаботились о том, чтобы ты ничего не забыл и подготовили <a href="http://hr-checklist.tilda.ws/new">чек-лист</a> нового сотрудника. 

Следи за жизнью компании на страницах: 
<a href="https://instagram.com/nti_2035?igshid=qmb9za2n5mi4">Instagram </a> 📸
<a href="https://m.facebook.com/2035nti/">Facebook </a> 📲
<a href="https://t.me/HR_NTI_2020">Telegram </a> 💬 
<a href="https://habr.com/ru/company/leader-id/">Хабр </a> 💻 
<a href="https://www.youtube.com/channel/UCOYwNauz2pFkvZ43E4emVmg">YouTube </a> 🎬'''

ada_6 = '''Заработная плата. 💵💰 

Выплаты производятся два раза в месяц: 10 числа - расчет за месяц, 25 числа - аванс.
Зарплатный проект - Сбербанк.
По вопросам получения  расчетного листа, справки 2-НДФЛ, вы можете обращаться к Шляпиной Ольге o.shlyapina@2035.university. 

Ваша адаптация окончена, мы рады приветствовать вас в экосистеме НТИ! 
Но вы все еще можете ко мне обращаться с вопросами, которые я могу передать в кадровую службу.
'''

