start_welcome_message = '''Привет! 

Я HR Lama, твой помощник в работе. Давай определим, чем я могу помочь? 

Если я не отвечаю, попробуй меня перезапустить командой /start или напиши @agoptar
'''

reg_start = "Для того чтобы начать работу с ботом - напиши в ответном сообщении свои имя и фамилию."

start_message = '''Привет! 

Я HR Lama, твой помощник в работе. Давай определим, чем я могу помочь? 

Если я не отвечаю, попробуй меня перезапустить командой /start или напиши @agoptar
'''

welcome_message = '''Привет! 

Я HR Lama, твой помощник в работе. Давай определим, чем я могу помочь? 

Если я не отвечаю, попробуй меня перезапустить командой /start или напиши @agoptar
'''

return_sticker = "CAACAgIAAxkBAAL3Z17xvSAfCN9gmMCLJZjDb9eE22U6AAJ4AAOcDygJ4Sfz8nF5fR8aBA"

faq_welcome = '''📌 Ты перешел в блок с часто задаваемыми вопросами.'''

faq_repeat = 'Какой у тебя вопрос?'

faq_continue = 'Надеюсь, что ты нашел ответы на все вопросы.'

faq_next_page = "📌 Следующая страница."

faq_1 = "Какой график работы?"

faq_1_answer = "С 9:30 до 18:30."

faq_2 = "Какой порядок выплаты ЗП?"

faq_2_answer = '''📌 Платформа НТИ:
10 числа 60%-13% налог
25 числа 40% 

📌 Университет 2035:
10 числа 50%-13% налог
25 числа 50% 
'''

faq_3 = "Где найти контакты сотрудников?"

faq_3_answer = '''В справочнике <a href="https://client.nti.work/docs/shared/path/HR/">Битрикс</a>'''

faq_4 = "Как забронировать переговорку в Точке кипения?"

faq_4_answer = "Через календарь, администратора Точки кипения или через чат-бот @leaderid_bot"

faq_5 = "Нужен ли пропуск в офис Сколково (ул. Нобеля 1)?"

faq_5_answer = "Нет."

faq_6 = "Нужен ли пропуск в офис Точки кипения?"

faq_6_answer = "Необходима регистрация на Leader-ID (QR код из профиля приветствуется)."

faq_7 = "Где найти шаблоны документов?"

faq_7_answer = '''Хранилище <a href="https://client.nti.work/docs/shared/path/HR/">Битрикс</a> 
Хранилище <a href="https://platform.2035.dev/projects">Nextcloud</a> Платформы НТИ
Хранилище Университета 2035

По поводу доступа к хранилищам и Битрикс обращаться к Денису Пастухову (тел. +7(915)391-12-66; du.pastuhov@nti.work; helpme@nti.work
'''

faq_8 = "Куда я могу обратиться по поводу парковки Точки кипения?"

faq_8_answer = "Ты можешь воспользоваться чат-ботом @leaderid_bot"

faq_9 = "Куда я могу обратиться по поводу парковки Сколково?"

faq_9_answer = "На вопросы о парковке в Сколково тебе сможет ответить Андрей Мелентьев (тел.+7(925)754-12-28)"

faq_10 = "К кому я могу обратиться по поводу технического оснащения рабочего места?"

faq_10_answer = '''Ответить на вопросы о техническом оснащении рабочего места сможет Денис Пастухов (тел. +7(915)391-12-66; du.pastuhov@nti.work; helpme@nti.work)'''

faq_11 = "К кому я могу обратиться по вопросам оформления кадровых документов и получения справок?"

faq_11_answer = "Оформить любые кадровые документы и справки тебе поможет Ольга Дулина (HR@nti.work - общая почта)"

faq_12 = "Кто поможет заказать канцелярские предметы?"

faq_12_answer = "За заказ канцелярских предметов отвечает Засыпкин Даниил (тел. +7(927)-701-19-97; d.zasypkin@nti.work; helpme@nti.work)"

faq_13 = "Где пройти курсы повышения квалификации?"

faq_13_answer = '''Ты можешь пройти <a href="https://my.2035.university/testme/now/stage/1">диагностику</a> от Университета 20.35. 
Обратите внимание на рекомендованные  <a href="http://lectoriy.2035.university/">курсы</a> и коллекции! 
Также можно найти полезные курсы в <a href="https://edu.asi.ru/">Навигаторе</a> образования АСИ. Все курсы бесплатные!
'''

faq_14 = "Как использовать корпоративный портал?"

faq_14_answer = '''В этом тебе поможет наше обучающее <a href="https://nc.lacloud.ru/index.php/f/37643756">видео</a>.'''

faq_15 = "Кто поможет подобрать нового сотрудника?"

faq_15_answer = '''Вы можете отправить заявку на почту HR@nti.work
Чтобы все получилось быстро и без проблем, следуй <a href="https://drive.google.com/file/d/1gMMaD5ixbnzbM-bhV6tR3T8yk-euaNKr/view?usp=sharing">алгоритму</a> приёма новых сотрудников'''

faq_16 = "Кто поможет заказать такси из офиса в офис?"

faq_16_answer = "Такси из офиса в офис тебе поможет заказать Засыпкин Даниил (+ 7-927-701-19-97) или Салахова Айтен (+7 -905-590-33-38)"

faq_17 = "Нужен ли мне 1С?"

faq_17_answer = '''1С нужен для того, чтобы: 
-регистрировать входящую корреспонденции 
-назначать и контролировать поручения 
-согласовывать приказы

Если у вас есть вопросы, вы можете воспользоваться линией поддержки по работе в СЭД. 
Чтобы получить консультацию, отправьте заявку на адрес ecm@nti.work или напишите в тех.службу helpme@nti.work'''

faq_18 = "Как оформить командировку?"

faq_18_answer = '''1. Зарегистрироваться на trello, перейти на корпоративную <a href="https://trello.com/b/RwhQxR80/командировки-платформа-нти">доску</a>. \n
2. В столбце «новая командировка» укажите дату, город и  приложите служебное задание. Подробная инструкция также расположена на доске. \n
3. Согласуйте командировку с руководителем. \n
4. Напишите трэвел агенту (nti@alavia.ru) по предпочтительным билетам, гостинице и трансферу. \n
5. Не забудьте отчитаться за командировку (отчет о выполненном задании, «корешки» от авиабилетов) Виктории Разиньковой(+7916 550 0936). \n
Более подробная инструкция и смысловик находятся на доске TRELLO.'''

faq_19 = "Как оформить закупку?"

faq_19_answer = '''Скачайте наше <a href="https://drive.google.com/file/d/1ruP84Y2HDIP4IoG_TgH9ARe2oauMM2Al/view?usp=drivesdk">Положение</a> о закупках.
Чтобы оформить закупку, вам потребуются следующие документы: \n
1. Заявка на закупку с указанием бюджетных аналитик \n
2. Техническое задание, согласованное владельцем бюджетной программы \n
3. Служебная записка с обоснованием целесообразности закупки. \n'''

faq_20 = "Где поесть в Точке кипения?"

faq_20_answer = '''Есть кухня с холодильником и микроволновкой. Foodnet кафе и вендинговый аппарат. 

Кафе поблизости <a href="https://www.google.com/search?rlz=1C1EJFA_enRU837RU837&sxsrf=ALeKk02zNaiKbnpQs5tqqGMW6ob5bl_qhw:1593512934525&q=%D0%BA%D0%B0%D1%84%D0%B5+%D0%BD%D0%B0+%D0%B1%D0%B0%D1%80%D1%80%D0%B8%D0%BA%D0%B0%D0%B4%D0%BD%D0%BE%D0%B9+%D0%BA%D0%B0%D1%80%D1%82%D0%B0&npsic=0&rflfq=1&rlha=0&rllag=55761458,37582918,245&tbm=lcl&ved=2ahUKEwj94aCjqqnqAhXpxcQBHb25B1AQjGp6BAgNED4&rldoc=1#rlfi=hd:;si:;mv:[[55.765506699999996,37.5930512],[55.7560303,37.569120999999996]];tbs:lrf:!1m4!1u3!2m2!3m1!1e1!1m4!1u2!2m2!2m1!1e1!2m1!1e2!2m1!1e3!3sIAE,lf:1,lf_ui:9">(карта)</a>:

Alexander’s МитПоинт ~ 200 р.
Квартира 44 ~ 230 р.
Пян-се ~ 250 р.
Бургер Кинг ~ 300 р.
КФС ~ 300 р.
Burger Heroes ~ 350 р.
Макдональд: ~ 350 р.
Кофемания ~ 550 р.
Му-му ~ 450 р.
Ваби-саби ~ 500 р.
Goodman ~ 2500 р.'''

faq_21 = "Где можно поесть в Сколково?"

faq_21_answer = '''Кафе поблизости <a href="https://www.google.com/search?rlz=1C1EJFA_enRU837RU837&tbm=lcl&sxsrf=ALeKk00eG5yITwfij0MHOSc0T3zLD43GMw:1593513004649&q=%D0%BA%D0%B0%D1%84%D0%B5+%D0%B2+%D1%81%D0%BA%D0%BE%D0%BB%D0%BA%D0%BE%D0%B2%D0%BE&spell=1&sa=X&ved=0ahUKEwid59jEqqnqAhV_wcQBHX9GDxMQBQgnKAA&biw=1422&bih=641&dpr=0.9#rlfi=hd:;si:;mv:[[55.702547495912256,37.41099526735137],[55.6785517568401,37.32499321086446],null,[55.69055146723095,37.367994239107915],14]">(карта)</a>:
Кафе «Coffee Smile». 
Бизнес-ланч: свежевыжатые соки, чай, кофе, десерты. Европейская и японская кухни. \n
Столовая «CANTEEN DailyFood». Открытая кухня, самообслуживание. \n
Кофейня «Daily Food». 
Напитки, выпечка, закуски. \n
«Кулинарная Лавка»\n
Столовая Fusion\n
Кафе "Сити Лайф"\n'''

faq_22 = '''Как оформить отпуск и где взять заявление?'''

faq_22_answer = '''Ищи форму в <a href="https://platform.2035.dev/projects/">Платформе</a>.'''

faq_23 = '''Сколько дней отпуска осталось?'''

faq_23_answer = '''Направь вопрос в блок бота задать вопрос. 
Или напиши напрямую на почту Hr@nti.work'''

help_welcome = "Напиши одно сообщение c вопросом. Оно будет направлено в HR блок."

help_wait = "Твой вопрос принят в обработку."

help_start_answer = "Новый вопрос от пользователя.\nID пользователя: {} \nЧтобы начать процедуру ответа на вопрос, введите /reply"

help_answer = "Получен ответ на твой вопрос:{}"

help_procedure = "Чтобы ответить на вопрос, введите ваш ответ в формате: \nID_пользователя ваш ответ"

stats_message = '''Статистика по боту:
Количество использований бота: {acts}
Количество сотрудников, взаимодействовавших с ботом: {users}
Количество взаимодействий с блоком FAQ: {faqs}
Количество отправленных смысловиков для оформления документов: {docs}
Количество пользователей, начавших адаптацию: {users_a_start}
Количество пользователей, завершивших адаптацию: {users_a_end}
Количество пользователей, прошедших квиз: {quiz_count}
Количество прохождений квиза: {quiz}
Средний балл за прохождение квиза: {quiz_avg}

https://platform.2035.dev/dashboard/'''

send_procedure = "Напишите в ответном сообщении текст рассылки для пользователей бота."

question_welcome = "📆 Здесь ты можешь задать свой вопрос касаемо " \
                   "приёма, увольнения, оплаты труда, остатка отпуска, запроса справки или копии документа, " \
                   "оформления отпуска. " \
                   "Напишите одно сообщение c вашим вопросом. Оно будет направлено в HR блок."

question_wait = "Твой вопрос принят в обработку."

question_start_answer = "Новый вопрос от пользователя.\nID пользователя: {} \nЧтобы начать процедуру ответа на вопрос, введите /send"

question_answer = '''📌 Мы обработали твой вопрос
A: {answer}'''

question_procedure = "Чтобы ответить на вопрос, введите ваш ответ в формате: \nID_пользователя ваш ответ"

reg_name = '''Представься, пожалуйста. Напишите в ответном сообщении имя и фамилию.'''

reg_confirm = '''Проверь, правильно ли ты указал имя?'''

reg_new = '''Для новых сотрудников я провожу адаптацию в нашей экосистеме. 
Согласен ли ты на протяжении недели получать полезную информацию и лайфхаки?'''

main_message = "Ты успешно зарегистрировался в экосистеме кадровых сервисов!"

reg_company = "Напиши организацию, в которой работаешь. "

reg_department = "Напиши свой департамент."

user_form = '''👤 Имя сотрудника: {username}
Ник Telegram: @{nickname}
Организация: {company}
Департамент: {department}'''

choice_menu = "Выбери блок меню"
